# Sales Analysis

#### Import Python Libraries

In [82]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline
import seaborn as sns

import glob
import os

from matplotlib import style
style.use("ggplot")

#### Merge Data from each month CSV file into one CSV file

In [83]:
#set working directory
os.chdir("/Users/kshitija/Documents/SalesAnalysis/Sales_Data")

#find all csv files in the folder
#use glob pattern matching -> extension = 'csv'
#save result in list -> all_filenames
extension = 'csv'
all_filenames = [i for i in glob.glob('*.{}'.format(extension))]

print(all_filenames)

#combine all files in the list
df = pd.concat([pd.read_csv(f) for f in all_filenames ])
#export to csv
df.to_csv( "df.csv", index=False, encoding='utf-8-sig')
#print(df.head())

['Sales_December_2019.csv', 'Sales_April_2019.csv', 'Sales_February_2019.csv', 'Sales_March_2019.csv', 'Sales_August_2019.csv', 'Sales_May_2019.csv', 'Sales_November_2019.csv', 'Sales_October_2019.csv', 'Sales_January_2019.csv', 'Sales_September_2019.csv', 'Sales_July_2019.csv', 'Sales_June_2019.csv']

#### Read in updated dataframe

In [84]:
df.head()

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
0,295665,Macbook Pro Laptop,1,1700,12/30/19 00:01,"136 Church St, New York City, NY 10001"
1,295666,LG Washing Machine,1,600.0,12/29/19 07:03,"562 2nd St, New York City, NY 10001"
2,295667,USB-C Charging Cable,1,11.95,12/12/19 18:21,"277 Main St, New York City, NY 10001"
3,295668,27in FHD Monitor,1,149.99,12/22/19 15:13,"410 6th St, San Francisco, CA 94016"
4,295669,USB-C Charging Cable,1,11.95,12/18/19 12:38,"43 Hill St, Atlanta, GA 30301"

In [85]:
df.shape

(186850, 6)

In [86]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 186850 entries, 0 to 13621
Data columns (total 6 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Order ID          186305 non-null  object
 1   Product           186305 non-null  object
 2   Quantity Ordered  186305 non-null  object
 3   Price Each        186305 non-null  object
 4   Order Date        186305 non-null  object
 5   Purchase Address  186305 non-null  object
dtypes: object(6)
memory usage: 10.0+ MB

In [87]:
df.describe()

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
count,186305,186305,186305,186305,186305,186305
unique,178438,20,10,24,142396,140788
top,Order ID,USB-C Charging Cable,1,11.95,Order Date,Purchase Address
freq,355,21903,168552,21903,355,355

#### Format Column Names

In [88]:
df.columns = df.columns.str.lower()
df.columns = df.columns.str.replace(' ','_')

In [89]:
df.head()

,order_id,product,quantity_ordered,price_each,order_date,purchase_address
0,295665,Macbook Pro Laptop,1,1700,12/30/19 00:01,"136 Church St, New York City, NY 10001"
1,295666,LG Washing Machine,1,600.0,12/29/19 07:03,"562 2nd St, New York City, NY 10001"
2,295667,USB-C Charging Cable,1,11.95,12/12/19 18:21,"277 Main St, New York City, NY 10001"
3,295668,27in FHD Monitor,1,149.99,12/22/19 15:13,"410 6th St, San Francisco, CA 94016"
4,295669,USB-C Charging Cable,1,11.95,12/18/19 12:38,"43 Hill St, Atlanta, GA 30301"

### Data Cleaning

#### Remove Duplicate Values in Primary Key Column

In [90]:
#display total number of values in order_id
df.shape

(186850, 6)

In [91]:
#calculate number of unique values in order_id
df.order_id.nunique()

178438

In [92]:
#display the number of duplicated values in order_id
df.duplicated(subset=['order_id']).sum()

8411

In [93]:
#drop/delete the duplicated values in order_id
df.drop_duplicates(subset=['order_id'], keep='first', inplace=True)

In [94]:
#check whether the changes were made or not
df.duplicated(subset=['order_id']).sum()

0

#### Find Null Values

In [95]:
#count all the null values in all columns
df.isnull().sum()

order_id            1
product             1
quantity_ordered    1
price_each          1
order_date          1
purchase_address    1
dtype: int64

In [96]:
#since we only have one null row, we can ignore that
print(df[df.isnull().any(axis=1)].head())

    order_id product quantity_ordered price_each order_date purchase_address
264      NaN     NaN              NaN        NaN        NaN              NaN

### Data Manupulation

#### Convert Object into Numeric DataType

In [98]:
#Change the datatype of price_each and quantity_ordered column
df['price_each'] = pd.to_numeric(df['price_each'],errors='coerce')
df['quantity_ordered'] = pd.to_numeric(df['quantity_ordered'],errors='coerce')

In [99]:
#to check
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 178439 entries, 0 to 13621
Data columns (total 6 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   order_id          178438 non-null  object
 1   product           178438 non-null  object
 2   quantity_ordered  178437 non-null  float64
 3   price_each        178437 non-null  float64
 4   order_date        178438 non-null  object
 5   purchase_address  178438 non-null  object
dtypes: float64(2), object(4)
memory usage: 9.5+ MB